[
  {
    "id": "1",
    "title": "Can You Freeze Cooked Rice? Yes, Here's How",
    "author": "Kelsey Dimberg",
    "date": "Sep. 26, 2024",
    "readTime": "6 min read",
    "tags": ["Frozen Foods", "Tips & Tricks"],
    "excerpt": "Can you freeze cooked rice? Absolutely, and you can still preserve the flavor and moisture and ensure it's safe to eat.",
    "image": "/assets/blog1.jpg",
    "content": "Freezing cooked rice is one of the most useful meal prep tricks you can master. Whether you've made a big batch of jasmine rice, brown rice, or sushi rice, freezing the leftovers means you'll always have a quick side dish or base for fried rice ready to go.\n\nThe key to freezing rice successfully is to cool it down quickly. After cooking, spread the rice out on a baking sheet and let it cool to room temperature within an hour. Never leave cooked rice out for more than two hours, as bacteria can multiply rapidly at room temperature.\n\nOnce cooled, portion the rice into zip-lock freezer bags or airtight containers. Flatten the bags to remove excess air — this speeds up freezing and thawing. Label each bag with the date. Frozen cooked rice keeps well for up to 3 months.\n\nTo reheat, you can microwave it directly from frozen. Sprinkle a tablespoon of water over the rice before microwaving to restore moisture. Cover loosely and heat in 1-minute intervals, stirring between each, until hot throughout.\n\nAlternatively, thaw the rice overnight in the refrigerator and then reheat in a pan with a splash of water or stock. This method gives you better control over the texture and is great if you're making fried rice.\n\nOne important safety note: never refreeze rice that has already been thawed. Cook thawed rice immediately and consume it within 24 hours. With these simple steps, you'll reduce food waste and always have rice ready when you need it."
  },
  {
    "id": "2",
    "title": "3 Store-Bought Salad Dressings You Should Always Have in Your Fridge",
    "author": "Ayla Clulee",
    "date": "May 15, 2020",
    "readTime": "3 min read",
    "tags": ["Appetizers", "Kitchen Essentials"],
    "excerpt": "I am a lover of homemade salad dressings. But sometimes you just need something quick, reliable, and absolutely delicious from the store.",
    "image": "/assets/blog2.jpeg",
    "content": "I'm a big advocate for making salad dressings from scratch. A simple vinaigrette of olive oil, lemon, Dijon mustard, and a touch of honey takes about two minutes and tastes better than almost anything from a bottle. But life gets busy, and sometimes you need a shortcut that doesn't feel like a compromise.\n\nAfter years of testing, I've narrowed it down to three store-bought dressings I genuinely love and reach for regularly.\n\nFirst: a classic Caesar. A well-made Caesar dressing is hard to replicate at home without anchovies and raw egg. The best store-bought options have that deep umami flavor and creamy texture that make even a simple romaine salad feel special. Look for brands that list anchovies early in the ingredients list.\n\nSecond: a good balsamic vinaigrette. This is the most versatile dressing you can own. It works on arugula, roasted vegetables, grain bowls, and even as a marinade for chicken. Choose one with a short ingredients list — aged balsamic vinegar, olive oil, garlic, and maybe a touch of honey.\n\nThird: a tahini or sesame-ginger dressing. These are harder to make well at home without a good tahini base, and a quality store-bought version is incredibly convenient for Asian-inspired salads, noodle bowls, and roasted cauliflower.\n\nHaving these three in your fridge means you're always ten minutes away from a delicious, well-dressed salad. Stock up and thank yourself later."
  },
  {
    "id": "3",
    "title": "How a California Family of 4 Spends $354 a Week on Groceries",
    "author": "Ayeh Manfre",
    "date": "Sep 5, 2024",
    "readTime": "5 min read",
    "tags": ["Food Budget", "Family Cooking"],
    "excerpt": "Stay-at-home mom, carnivore content creator and cookbook author — here's how our family feeds four on a weekly grocery run.",
    "image": "/assets/blog3.jpeg",
    "content": "Every week, I plan meals for a family of four that includes two teenagers with very different food preferences, a husband who loves red meat, and me — a food blogger and cookbook author who values quality ingredients above almost everything else.\n\nOur weekly grocery budget is $354. That might sound like a lot or a little depending on where you live, but in California, where produce is excellent and meat prices have climbed significantly, it's a number I've landed on after years of fine-tuning.\n\nBreakdown by category: We spend about $80 on proteins — mostly grass-fed beef, chicken thighs, and salmon. We spend around $70 on fresh produce, which is easy to do here since California farmers markets offer incredible value. Dairy and eggs run about $40 a week. Pantry staples — olive oil, canned tomatoes, pasta, rice, spices — are roughly $60 per week on average, though some weeks are much less if we're well-stocked. Snacks, beverages, and miscellaneous add the remaining $104.\n\nThe biggest money-saving strategy I use is batch cooking on Sundays. I'll roast a large tray of vegetables, cook a big pot of grains, and marinate proteins that can be used across three or four different meals throughout the week. This cuts down on both food waste and the temptation to order takeout when we're tired.\n\nMy other rule: never shop hungry, and always shop with a list organized by section of the store. It sounds simple, but it's saved us hundreds of dollars over the years."
  },
  {
    "id": "4",
    "title": "Top 5 Healthy Breakfast Ideas to Start Your Day Right",
    "author": "Jane Doe",
    "date": "Aug 1, 2024",
    "readTime": "4 min read",
    "tags": ["Healthy", "Breakfast"],
    "excerpt": "Start your day with these delicious and nutritious breakfast recipes that are quick to make and keep you full for hours.",
    "image": "/assets/blog4.jpg",
    "content": "Breakfast is the most important meal of the day, and it doesn't have to be complicated. After years of testing quick morning recipes, I've found five breakfasts that are genuinely satisfying, nutritious, and fast enough to make on a weekday.\n\n1. Overnight oats with chia seeds and berries. Combine rolled oats, chia seeds, almond milk, and a drizzle of maple syrup in a jar the night before. In the morning, top with fresh berries and a spoonful of nut butter. It takes literally two minutes to prep and keeps you full until lunch.\n\n2. Avocado toast with a poached egg. Mash ripe avocado with lemon juice and chili flakes on sourdough toast. Top with a perfectly poached egg. This gives you healthy fats, protein, and complex carbs all in one meal.\n\n3. Greek yogurt parfait. Layer full-fat Greek yogurt with granola, honey, and seasonal fruit. High in protein and probiotics, this is one of the most nourishing breakfasts you can eat with almost no effort.\n\n4. Veggie scrambled eggs. Sauté whatever vegetables you have on hand — spinach, cherry tomatoes, mushrooms — and fold in whisked eggs. Season well, add feta or parmesan, and breakfast is done in under ten minutes.\n\n5. Smoothie bowl. Blend frozen banana and berries with a splash of oat milk until thick. Pour into a bowl and top with seeds, granola, and sliced fruit. It feels indulgent but is packed with nutrients.\n\nThe secret to a good breakfast habit is preparation. If you set out your ingredients the night before, you're much more likely to actually eat in the morning rather than grab something processed."
  }
]
